app/controllers/events_controller.rb

INSERT INTO "events" ("title", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test4"], ["start_time", "2000-01-01 04:00:00"], ["end_time", "2000-01-01 05:30:00"], ["created_at", "2018-02-12 21:17:29.780640"], ["updated_at", "2018-02-12 21:17:29.780640"]]
---
  def create
    # creates the event.
    @event = Event.new(event_params)

    # save to database.
    @event.save